app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_animal
      @animal = Animal.find(params[:id])